DataProcessors/омг_Обучение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>омг_Обучение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>cfg:DynamicList</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:DynamicList</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/омг_ТипыКонтента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>омг_ТипыКонтента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Видео</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/омг_РазделыОбучения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>омг_РазделыОбучения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВидео</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_ТипыКонтента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКартинкиТипаКонтента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/омг_Обучение/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СодержаниеПриАктивизацииСтроки(Элемент)
	Строка = Элементы.Содержание.ТекущиеДанные;  
	ТипКонтента = Элементы.СодержаниеТипКонтента; 
	
	Если Строка = Неопределено ИЛИ Строка.НомерКартинкиТипаКонтента = 0 Тогда
		HTML = "<html><head></head><body><iframe width='560' height='315' src='<p>Ничего не выбрано</p>' frameborder='0' allowfullscreen></iframe></body></html>";
		Возврат;
	КонецЕсли; 
	Строка = Строка.Наименование;
	Данные = ПолучитьДанныеОбученияНаСервере(Строка);
	
	Если Данные.ТипКонтента = "Видео" Тогда  
		Ссылка = Данные.СсылкаНаВидео;
		//HTML = "<html><head></head><body><iframe width='560' height='315' src='" + Ссылка + "' frameborder='0' allowfullscreen></iframe></body></html>";
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("html");
		ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла);
		
		ТекстДокумента = "
		|<html>
		|<head></head>
		|<body>
		|  <div style='position: relative; padding-top: 54.17%; width: 100%'>
		|    <iframe src='" + Ссылка + "' 
		|    allow='autoplay; fullscreen; picture-in-picture; 
		|    encrypted-media; gyroscope; accelerometer; clipboard-write; screen-wake-lock;' 
		|    frameborder='0' allowfullscreen style='position: absolute; width: 100%; height: 100%; top: 0; left: 0;'>
		|   </iframe>
		|  </div>
		|</body>
		|</html>";
		
		ЗаписьТекста.Записать(ТекстДокумента);
		ЗаписьТекста.Закрыть();
		
		ЗапуститьПриложениеАсинх(ИмяВременногоФайла);
		
		
		
	Иначе
		СтрокаКеш = ПолучитьКешированныйПутьКФайлу(Данные.Документ);
		Если СтрокаКеш = Неопределено Тогда 
			СтрокаКеш = ВыполнитьОткрытиеФайла(Данные.Документ);
			
		КонецЕсли;
		Ссылка = СтрокаКеш;
		HTML = "<html><head></head><body><div style='position: relative; padding-top: 54.17%; width: 100%'><iframe src='"+ Ссылка +"' allow='autoplay; fullscreen; picture-in-picture; encrypted-media; gyroscope; accelerometer; clipboard-write; screen-wake-lock;' frameborder='0' allowfullscreen style='position: absolute; width: 100%; height: 100%; top: 0; left: 0;'></iframe></div></body></html>";
		
	КонецЕсли;
	Объект.ПолеHTML = HTML;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКешированныйПутьКФайлу(СсылкаНаФайл)
	
	НайдСтроки = КешПутейКФайлам.НайтиСтроки(Новый Структура("Файл", СсылкаНаФайл));
	Если НайдСтроки.Количество() > 0 Тогда 
		Возврат НайдСтроки[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеОбученияНаСервере(Строка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|    Разделы.ТипКонтента,
	|    Разделы.Документ,
	|    Разделы.СсылкаНаВидео
	|ИЗ
	|    Справочник.омг_РазделыОбучения КАК Разделы
	|ГДЕ
	|    Разделы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Строка);
	
	// Выполнение запроса
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		РезультатЗапроса = Новый Структура;
		Если Выборка.ТипКонтента = Перечисления.омг_ТипыКонтента.Видео Тогда
			ТипКонтента = "Видео"
		Иначе
			ТипКонтента = "Документ" 
		КонецЕсли;
		РезультатЗапроса.Вставить("ТипКонтента", ТипКонтента); 
		РезультатЗапроса.Вставить("Документ", Выборка.Документ);
		РезультатЗапроса.Вставить("СсылкаНаВидео", Выборка.СсылкаНаВидео);
		Возврат РезультатЗапроса;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
&НаКлиенте
Функция ВыполнитьОткрытиеФайла(СсылкаНаФайл, КешированныйПуть=Неопределено)
	
	РасширениеФайла = НРег(ОбщегоНазначения.ПолучитьЗначениеРеквизита(СсылкаНаФайл, "Расширение"));
	Если РасширениеФайла = ".mxl" Тогда
		ПутьКФайлу = РаботаСФайламиКлиент.ОткрытьФайл(СсылкаНаФайл,,КешированныйПуть, Истина);
		Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Прикрепленный файл не найден");
			Возврат "";
		КонецЕсли;
		
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу), УникальныйИдентификатор);
		////СтруктураПечати = ПолучитьСтруктуруПечатиТабДока(АдресХранилища);
		//Если СтруктураПечати = Неопределено Тогда 
		//	ОбщегоНазначения.СообщитьПользователю("Не удалось открыть файл");
		//Иначе
		//	ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураПечати, Неопределено);
		//КонецЕсли;
	Иначе
		ПутьКФайлу = РаботаСФайламиКлиент.ОткрытьФайл(СсылкаНаФайл,,КешированныйПуть,ИСТИНА); 
	КонецЕсли;
	
	Возврат ПутьКФайлу;
	
КонецФункции 

&НаКлиенте
Процедура СодержаниеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.СодержаниеСсылкаНаВидео.Видимость = ЛОЖЬ;
КонецПроцедуры
